nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXE247
package_id: MCXE247VLQ
mcu_data: ksdk2_0
processor_version: 0.2506.30
pin_labels:
- {pin_num: '55', pin_signal: PTD8/LPI2C1_SDA/MII_RXD3/FTM2_FLT2/FXIO_D1/FTM1_CH4/QSPI_B_IO5, label: I2C1_SDA, identifier: I2C1_SDA}
- {pin_num: '54', pin_signal: PTD9/LPI2C1_SCL/FXIO_D0/FTM2_FLT3/MII_RXD2/FTM1_CH5/QSPI_B_IO4, label: I2C1_SCL, identifier: I2C1_SCL}
- {pin_num: '121', pin_signal: PTE6/LPSPI0_PCS2/FTM7_FLT1/FTM3_CH7/LPUART1_RTS/ADC1_SE11, label: LPSPI0_PCS2, identifier: LPSPI0_PCS2}
- {pin_num: '63', pin_signal: PTB3/FTM1_CH1/LPSPI0_SIN/FTM1_QD_PHA/TRGMUX_IN2/ADC0_SE7, label: LPSPI0_SIN, identifier: LPSPI0_SIN}
- {pin_num: '122', pin_signal: PTE2/LPSPI0_SOUT/LPTMR0_ALT3/FTM3_CH6/LPUART1_CTS/SAI1_SYNC/ADC1_SE10, label: LPSPI0_SOUT, identifier: LPSPI0_SOUT}
- {pin_num: '138', pin_signal: PTE0/LPSPI0_SCK/TCLK1/LPI2C1_SDA/LPSPI1_SOUT/FTM1_FLT2/SAI0_D2, label: LPSPI0_SCK, identifier: LPSPI0_SCK}
- {pin_num: '1', pin_signal: PTE16/LPUART1_RTS/LPSPI2_SIN/FTM2_CH7/FTM4_FLT0/FXIO_D3/TRGMUX_OUT7, label: LPSPI2_SIN, identifier: LPSPI2_SIN}
- {pin_num: '144', pin_signal: PTA8/LPUART2_RX/LPSPI2_SOUT/FXIO_D6/FTM3_FLT3/FTM4_FLT1, label: LPSPI2_SOUT, identifier: LPSPI2_SOUT}
- {pin_num: '59', pin_signal: PTC15/FTM1_CH3/LPSPI2_SCK/MII_CRS/TRGMUX_IN8/QSPI_B_CS/ADC0_SE13, label: LPSPI2_SCK, identifier: LPSPI2_SCK}
- {pin_num: '6', pin_signal: PTE10/CLKOUT/LPSPI2_PCS1/FTM2_CH4/FXIO_D4/TRGMUX_OUT4, label: LPSPI2_PCS1, identifier: LPSPI2_PCS1}
- {pin_num: '29', pin_signal: PTD15/FTM0_CH0/ETM_TRACE_D3/LPSPI0_SCK/ENET_TMR2, label: PWM_AT_CH0, identifier: PWM_AT;PWM_AT_CH0}
- {pin_num: '28', pin_signal: PTD16/FTM0_CH1/ETM_TRACE_D2/LPSPI0_SIN/CMP0_RRT/ETM_TRACE_CLKOUT, label: PWM_AB_CH1, identifier: PWM_AB;PWM_AB_CH1}
- {pin_num: '94', pin_signal: PTB16/FTM0_CH4/LPSPI1_SOUT/ADC1_SE15, label: PWM_BT_CH4, identifier: PWM_BT_CH4}
- {pin_num: '93', pin_signal: PTB17/FTM0_CH5/LPSPI1_PCS3/FTM5_FLT1, label: PWM_BB_CH5, identifier: PWM_BB_CH5}
- {pin_num: '92', pin_signal: PTA17/FTM0_CH6/FTM3_FLT0/EWM_OUT_b/FTM5_FLT0, label: PWM_CT_CH6, identifier: PWM_CT_CH6}
- {pin_num: '87', pin_signal: PTE7/FTM0_CH7/FTM3_FLT0, label: PWM_CB_CH7, identifier: PWM_CB_CH7}
- {pin_num: '77', pin_signal: PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0/CAN0_TX/FTM4_CH5/ADC0_SE5/ADC1_SE15, label: VOLT_DCB, identifier: VOLT_DCB}
- {pin_num: '100', pin_signal: PTD4/FTM0_FLT3/FTM3_FLT3/ADC1_SE6, label: CUR_C, identifier: CUR_C}
- {pin_num: '85', pin_signal: PTA6/FTM0_FLT1/LPSPI1_PCS1/FTM5_CH5/LPUART1_CTS/ADC0_SE2, label: CUR_B, identifier: CUR_B}
- {pin_num: '120', pin_signal: PTA15/FTM1_CH2/LPSPI0_PCS3/LPSPI2_PCS3/FTM7_FLT0/ADC1_SE12, label: CUR_A, identifier: CUR_A}
- {pin_num: '115', pin_signal: PTA0/FTM2_CH1/LPI2C0_SCLS/FXIO_D2/FTM2_QD_PHA/LPUART0_CTS/TRGMUX_OUT3/ADC0_SE0/CMP0_IN0, label: VOLT_DCB, identifier: VOLT_DCB}
- {pin_num: '127', pin_signal: PTA14/FTM0_FLT0/FTM3_FLT1/EWM_IN/FTM1_FLT0/SAI0_D3, label: TP, identifier: TP}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_trgmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitCMPPins();
    BOAED_InitLEDPins();
    BOARD_InitLEDsPins();
    BOARD_InitBUTTONsPins();
    BOARD_InitFTM();
    BOARD_InitADC();
    BOARD_InitCMP();
    BOARD_InitTP();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: LPUART2, signal: RX, pin_signal: PTD17/FTM0_FLT2/LPUART2_RX/FTM5_FLT1}
  - {pin_num: '23', peripheral: LPUART2, signal: TX, pin_signal: PTE12/FTM0_FLT3/LPUART2_TX/FTM5_FLT0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

