nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitI2CPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port D */
        PORTD,
        /* Digital filter is configured for PORTD0 */
          PORT_DFER_DFE_8_MASK
            /* Digital filter is configured for PORTD1 */
            | PORT_DFER_DFE_9_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t I2C1_SDA = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as LPI2C1_SDA */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTD8 (pin 55) is configured as LPI2C1_SDA */
    PORT_SetPinConfig(BOARD_INITI2CPINS_I2C1_SDA_PORT, BOARD_INITI2CPINS_I2C1_SDA_PIN, &I2C1_SDA);

    const port_pin_config_t I2C1_SCL = {/* Internal pull-up resistor is enabled */
                                        kPORT_PullUp,
                                        /* Passive filter is disabled */
                                        kPORT_PassiveFilterDisable,
                                        /* Low drive strength is configured */
                                        kPORT_LowDriveStrength,
                                        /* Pin is configured as LPI2C1_SCL */
                                        kPORT_MuxAlt2,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        kPORT_UnlockRegister};
    /* PORTD9 (pin 54) is configured as LPI2C1_SCL */
    PORT_SetPinConfig(BOARD_INITI2CPINS_I2C1_SCL_PORT, BOARD_INITI2CPINS_I2C1_SCL_PIN, &I2C1_SCL);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFTM:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '29', peripheral: FTM0, signal: 'CH, 0', pin_signal: PTD15/FTM0_CH0/ETM_TRACE_D3/LPSPI0_SCK/ENET_TMR2, identifier: PWM_AT_CH0, direction: OUTPUT}
  - {pin_num: '28', peripheral: FTM0, signal: 'CH, 1', pin_signal: PTD16/FTM0_CH1/ETM_TRACE_D2/LPSPI0_SIN/CMP0_RRT/ETM_TRACE_CLKOUT, identifier: PWM_AB_CH1, direction: OUTPUT}
  - {pin_num: '94', peripheral: FTM0, signal: 'CH, 4', pin_signal: PTB16/FTM0_CH4/LPSPI1_SOUT/ADC1_SE15, direction: OUTPUT}
  - {pin_num: '93', peripheral: FTM0, signal: 'CH, 5', pin_signal: PTB17/FTM0_CH5/LPSPI1_PCS3/FTM5_FLT1, direction: OUTPUT}
  - {pin_num: '92', peripheral: FTM0, signal: 'CH, 6', pin_signal: PTA17/FTM0_CH6/FTM3_FLT0/EWM_OUT_b/FTM5_FLT0, direction: OUTPUT}
  - {pin_num: '87', peripheral: FTM0, signal: 'CH, 7', pin_signal: PTE7/FTM0_CH7/FTM3_FLT0, direction: OUTPUT}
  - {peripheral: PDB0, signal: TRG, pin_signal: TRGMUX_FTM0_INIT_TRIG}
  - {peripheral: PDB1, signal: TRG, pin_signal: TRGMUX_FTM0_INIT_TRIG}
  - {peripheral: FTM0, signal: 'TRG, 1', pin_signal: TRGMUX_CMP0_OUT}
  - {pin_num: '21', peripheral: FTM0, signal: 'FLT, 0', pin_signal: PTE3/FTM0_FLT0/LPUART2_RTS/FTM2_FLT0/TRGMUX_IN6/CMP0_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFTM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFTM(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA17 (pin 92) is configured as FTM0_CH6 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_CT_CH6_PORT, BOARD_INITFTM_PWM_CT_CH6_PIN, kPORT_MuxAlt2);

    /* PORTB16 (pin 94) is configured as FTM0_CH4 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_BT_CH4_PORT, BOARD_INITFTM_PWM_BT_CH4_PIN, kPORT_MuxAlt2);

    /* PORTB17 (pin 93) is configured as FTM0_CH5 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_BB_CH5_PORT, BOARD_INITFTM_PWM_BB_CH5_PIN, kPORT_MuxAlt2);

    /* PORTD15 (pin 29) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_AT_CH0_PORT, BOARD_INITFTM_PWM_AT_CH0_PIN, kPORT_MuxAlt2);

    /* PORTD16 (pin 28) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_AB_CH1_PORT, BOARD_INITFTM_PWM_AB_CH1_PIN, kPORT_MuxAlt2);

    /* PORTE3 (pin 21) is configured as FTM0_FLT0 */
    PORT_SetPinMux(PORTE, 3U, kPORT_MuxAlt2);

